app/controllers/submits_controller.rb

  def index
    @submits = Submit.all
---
SELECT "submits".* FROM "submits"

  def create
    @submit = Submit.new(submit_params)

    respond_to do |format|
      if @submit.save
---
INSERT INTO "submits" ("created_at", "description", "language", "source", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 16 Mar 2014 06:21:00 UTC +00:00], ["description", "HelloWorld"], ["language", "ruby"], ["source", "puts \"HelloWorld\""], ["updated_at", Sun, 16 Mar 2014 06:21:00 UTC +00:00]]

    def set_submit
      @submit = Submit.find(params[:id])
---
SELECT "submits".* FROM "submits" WHERE "submits"."id" = ? LIMIT 1  [["id", "c"]]